# IMPORTING DATA

In [1]:
# import libraries
import pandas as pd
import numpy as np
import os

In [2]:
# initialize path variable
path = r'/Users/smac_/Documents/Career/Application Package/Portfolio/Projects/Instacart Sales Analysis'

In [3]:
# import data
df_orders = pd.read_csv(os.path.join(path, '02 Data', 'Original Data','orders.csv'))
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'))
df_depts = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'departments.csv'))
df_cust = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))
df_orders_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'orders_products_prior.csv'))

# DATA OVERVIEW

## `'df_orders'` DATAFRAME

In [4]:
# dataframe size
df_orders.shape

(3421083, 7)

In [5]:
# column names & datatypes
df_orders.dtypes

order_id                    int64
user_id                     int64
eval_set                   object
order_number                int64
order_dow                   int64
order_hour_of_day           int64
days_since_prior_order    float64
dtype: object

In [6]:
# first 5 rows
df_orders.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

In [7]:
# last 5 rows
df_orders.tail()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
3421078,2266710,206209,prior,10,5,18,29.0
3421079,1854736,206209,prior,11,4,10,30.0
3421080,626363,206209,prior,12,1,12,18.0
3421081,2977660,206209,prior,13,1,12,7.0
3421082,272231,206209,train,14,6,14,30.0

## `'df_prods'` DATAFRAME

In [8]:
# dataframe size
df_prods.shape

(49693, 5)

In [9]:
# column names & data types
df_prods.dtypes

product_id         int64
product_name      object
aisle_id           int64
department_id      int64
prices           float64
dtype: object

In [10]:
# first 5 rows
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [11]:
# last 5 rows
df_prods.tail()

,product_id,product_name,aisle_id,department_id,prices
49688,49684,"Vodka, Triple Distilled, Twist of Vanilla",124,5,5.3
49689,49685,En Croute Roast Hazelnut Cranberry,42,1,3.1
49690,49686,Artisan Baguette,112,3,7.8
49691,49687,Smartblend Healthy Metabolism Dry Cat Food,41,8,4.7
49692,49688,Fresh Foaming Cleanser,73,11,13.5

## `'df_orders_prods'` DATAFRAME

In [12]:
# dataframe size
df_orders_prods.shape

(32434489, 4)

In [13]:
# column names & datatypes
df_orders_prods.dtypes

order_id             int64
product_id           int64
add_to_cart_order    int64
reordered            int64
dtype: object

In [14]:
# first 5 rows
df_orders_prods.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [15]:
# last 5 rows
df_orders_prods.tail()

          order_id  product_id  add_to_cart_order  reordered
32434484   3421083       39678                  6          1
32434485   3421083       11352                  7          0
32434486   3421083        4600                  8          0
32434487   3421083       24852                  9          1
32434488   3421083        5020                 10          1

## `'df_cust'` DATAFRAME

In [16]:
# dataframe size
df_cust.shape

(206209, 10)

In [17]:
# column names & datatypes
df_cust.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [18]:
# first 5 rows
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [19]:
# last 5 rows
df_cust.tail()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
206204,168073,Lisa,Case,Female,North Carolina,44,4/1/2020,1,married,148828
206205,49635,Jeremy,Robbins,Male,Hawaii,62,4/1/2020,3,married,168639
206206,135902,Doris,Richmond,Female,Missouri,66,4/1/2020,2,married,53374
206207,81095,Rose,Rollins,Female,California,27,4/1/2020,1,married,99799
206208,80148,Cynthia,Noble,Female,New York,55,4/1/2020,1,married,57095

## `'df_depts'` DATAFRAME

In [20]:
# dataframe size
df_depts.shape

(1, 22)

In [21]:
# column names & data types
df_depts.dtypes

department_id    object
1                object
2                object
3                object
4                object
5                object
6                object
7                object
8                object
9                object
10               object
11               object
12               object
13               object
14               object
15               object
16               object
17               object
18               object
19               object
20               object
21               object
dtype: object

In [22]:
# first 5 rows
df_depts.head()

,department_id,1,2,3,4,5,6,7,8,9,...,12,13,14,15,16,17,18,19,20,21
0,department,frozen,other,bakery,produce,alcohol,international,beverages,pets,dry goods pasta,...,meat seafood,pantry,breakfast,canned goods,dairy eggs,household,babies,snacks,deli,missing

In [23]:
# last 5 rows
df_depts.tail()

,department_id,1,2,3,4,5,6,7,8,9,...,12,13,14,15,16,17,18,19,20,21
0,department,frozen,other,bakery,produce,alcohol,international,beverages,pets,dry goods pasta,...,meat seafood,pantry,breakfast,canned goods,dairy eggs,household,babies,snacks,deli,missing

# DATA WRANGLING

## '`df_orders`' DATAFRAME

In [24]:
# drop 'eval_set' column
df_orders = df_orders.drop(columns = ['eval_set'])

In [25]:
# cast nominal columns as string
df_orders['order_id'] = df_orders['order_id'].astype('str')
df_orders['user_id'] = df_orders['user_id'].astype('str')

In [26]:
# replace NaN values in 'days_since_prior_order' with None
df_orders['days_since_prior_order'] = df_orders['days_since_prior_order'].where(pd.notnull(df_orders['days_since_prior_order']), None)

# convert values to integer type
df_orders['days_since_prior_order'] = df_orders['days_since_prior_order'].astype('Int64')

## '`df_prods`' DATAFRAME

In [27]:
# cast nominal columns as string
df_prods['product_id'] = df_prods['product_id'].astype('str')
df_prods['aisle_id'] = df_prods['aisle_id'].astype('str')
df_prods['department_id'] = df_prods['department_id'].astype('str')

## `'df_orders_prods'` DATAFRAME

In [28]:
# cast nominal columns as string
df_orders_prods['order_id'] = df_orders_prods['order_id'].astype(str)
df_orders_prods['product_id'] = df_orders_prods['product_id'].astype(str)
df_orders_prods['reordered'] = df_orders_prods['reordered'].astype(str)

In [29]:
# replace boolean values in 'reordered' column
df_orders_prods['reordered'] = df_orders_prods['reordered'].replace({'0': 'No', '1': 'Yes'})

In [30]:
df_orders_prods.head()

  order_id product_id  add_to_cart_order reordered
0        2      33120                  1       Yes
1        2      28985                  2       Yes
2        2       9327                  3        No
3        2      45918                  4       Yes
4        2      30035                  5        No

## `'df_cust'` DATAFRAME

In [31]:
# drop PII columns
df_cust = df_cust.drop(columns = ['First Name', 'Surnam'])

In [32]:
# rename colums
new_column_names = {'user_id' : 'user_id', 'Gender' : 'gender', 'STATE' : 'state', 'Age' : 'age', 'date_joined' : 'date_joined', 'n_dependants' : 'dependants', 'fam_status' : 'marital_status', 'income' : 'income'}
df_cust = df_cust.rename(columns = new_column_names)

In [33]:
# cast nominal columns as string
df_cust['user_id'] = df_cust['user_id'].astype(str)

## `'df_depts'` DATAFRAME

In [34]:
# transposing df_depts to long format
df_depts_t = df_depts.T
df_depts_t.reset_index() # add an index
new_header = df_depts_t.iloc[0] # initialize variable containing the row to act as the new header
df_depts_transposed = df_depts_t [1:] # initialize a new dataframe excluding the header row
df_depts_transposed.columns = new_header # assign the new header row
df_depts_transposed

department_id       department
1                       frozen
2                        other
3                       bakery
4                      produce
5                      alcohol
6                international
7                    beverages
8                         pets
9              dry goods pasta
10                        bulk
11               personal care
12                meat seafood
13                      pantry
14                   breakfast
15                canned goods
16                  dairy eggs
17                   household
18                      babies
19                      snacks
20                        deli
21                     missing

In [35]:
# dataframe size
df_depts_transposed.shape

(21, 1)

# QUALITY MEASURES

## ACCURACY & CONSISTENCY

### `'df_orders'` DATAFRAME

In [36]:
# summary stats
df_orders.describe()

       order_number     order_dow  order_hour_of_day  days_since_prior_order
count  3.421083e+06  3.421083e+06       3.421083e+06               3214874.0
mean   1.715486e+01  2.776219e+00       1.345202e+01               11.114836
std    1.773316e+01  2.046829e+00       4.226088e+00                9.206737
min    1.000000e+00  0.000000e+00       0.000000e+00                     0.0
25%    5.000000e+00  1.000000e+00       1.000000e+01                     4.0
50%    1.100000e+01  3.000000e+00       1.300000e+01                     7.0
75%    2.300000e+01  5.000000e+00       1.600000e+01                    15.0
max    1.000000e+02  6.000000e+00       2.300000e+01                    30.0

In [37]:
# evaluate for full duplicates
print(df_orders[df_orders.duplicated()])

Empty DataFrame
Columns: [order_id, user_id, order_number, order_dow, order_hour_of_day, days_since_prior_order]
Index: []

No full duplicated were found.

In [38]:
# identify missing values
df_orders.isnull().sum()

order_id                       0
user_id                        0
order_number                   0
order_dow                      0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

Upon examining the consistency of the `days_since_prior_order` column, a **considerable proportion of 171,952 missing values** were discovered. This raises the possibility that these missing values correspond to new customers who haven't made any orders yet, resulting in no value being assigned to them in this column.

If the missing values have meaningful implications, it is recommended to retain them in the dataframe as they could hold relevance for the analysis. By preserving these values, valuable insights or patterns that may contribute to the analysis can be effectively captured.

In [39]:
# evaluate for mixed-type columns
for col in df_orders.columns.tolist():
  weird = (df_orders[[col]].applymap(type) != df_orders[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_orders[weird]) > 0:
    print (col)

days_since_prior_order

The column 'days_since_prior_order' is identified as mixed-type, however, this is due to the presence of missing values. Since these values have meaningful implications to the analysis, no further action is required.

### `'df_prods'` DATAFRAME

In [40]:
# summary stats
df_prods.describe()

             prices
count  49693.000000
mean       9.994136
std      453.519686
min        1.000000
25%        4.100000
50%        7.100000
75%       11.200000
max    99999.000000

The maximum value significantly deviates from the expected range of values, indicating a potential anomaly. Further investigation is necessary to understand the underlying cause.

In [41]:
# 'prices' column frequency counts sorted by value in descending order
df_prods['prices'].value_counts().sort_index(ascending = False)

99999.0      1
14900.0      1
25.0         5
24.9         6
24.8         5
          ...
1.4        321
1.3        286
1.2        297
1.1        296
1.0        116
Name: prices, Length: 242, dtype: int64

In [42]:
inconsistent_price_prods = df_prods[(df_prods['prices'] == 99999) | (df_prods['prices'] == 14900)]
inconsistent_price_prods

,product_id,product_name,aisle_id,department_id,prices
21554,21553,Lowfat 2% Milkfat Cottage Cheese,108,16,14900.0
33666,33664,2 % Reduced Fat Milk,84,16,99999.0

Since data on the price of these products is incorrect and can't be found anywhere else, I decided to impute the values with the median of the price of all products.

In [43]:
# impute inconsistent prices with median
median_prices = df_prods['prices'].median()
values_to_replace = [99999, 14900]
df_prods['prices'] = df_prods['prices'].replace(values_to_replace, median_prices)

In [44]:
# re-evaluate frequency counts of 'prices'
df_prods['prices'].value_counts().sort_index(ascending = False)

25.0      5
24.9      6
24.8      5
24.7      5
24.6      4
       ...
1.4     321
1.3     286
1.2     297
1.1     296
1.0     116
Name: prices, Length: 240, dtype: int64

In [45]:
# evaluate for full duplicates
print(df_prods[df_prods.duplicated()])

      product_id                                       product_name aisle_id  \
462          462                  Fiber 4g Gummy Dietary Supplement       70
18459      18458                                         Ranger IPA       27
26810      26808               Black House Coffee Roasty Stout Beer       27
35309      35306  Gluten Free Organic Peanut Butter & Chocolate ...      121
35495      35491                            Adore Forever Body Wash      127

      department_id  prices
462              11     4.8
18459             5     9.2
26810             5    13.4
35309            14     6.8
35495            11     9.9

This dataframe contains 5 duplicated records.

In [46]:
# remove full duplicates
df_prods = df_prods.drop_duplicates()

In [47]:
# evaluate missing values
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [48]:
# initialize subset dataframe containing rows with missing values in 'product_name'
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [49]:
# all rows in 'df_nan' dataframe
df_nan.head(16)

      product_id product_name aisle_id department_id  prices
33            34          NaN      121            14    12.2
68            69          NaN       26             7    11.8
115          116          NaN       93             3    10.8
261          262          NaN      110            13    12.1
525          525          NaN      109            11     1.2
1511        1511          NaN       84            16    14.3
1780        1780          NaN      126            11    12.3
2240        2240          NaN       52             1    14.2
2586        2586          NaN      104            13    12.4
3159        3159          NaN      126            11    13.1
3230        3230          NaN      120            16    14.4
3736        3736          NaN       41             8    14.8
4283        4283          NaN       77             7    14.4
4790        4790          NaN       91            16    14.5
38187      38183          NaN       39            12    20.9
40444      40440          NaN      120            16    14.8

In [50]:
df_nan.shape

(16, 5)

The `product_name` column contains a total of 16 missing values. The absence of any discernible pattern suggests that these missing values are likely a result of errors during the data collection process.

In [51]:
# initialize subset dataframe excluding rows with missing values in 'product_name' 
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [52]:
# evaluate for mixed-type columns
for col in df_prods_clean.columns.tolist():
  weird = (df_prods_clean[[col]].applymap(type) != df_prods_clean[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_prods_clean[weird]) > 0:
    print (col)

No mixed-type data columns were found.

### `'df_orders_prods'` DATAFRAME

In [53]:
# summary stats
df_orders_prods.describe()

       add_to_cart_order
count       3.243449e+07
mean        8.351076e+00
std         7.126671e+00
min         1.000000e+00
25%         3.000000e+00
50%         6.000000e+00
75%         1.100000e+01
max         1.450000e+02

In [54]:
# evaluate missing values
df_orders_prods.isnull().sum()

order_id             0
product_id           0
add_to_cart_order    0
reordered            0
dtype: int64

No missing values were found.

In [55]:
# evaluate for full duplicates
print(df_orders_prods[df_orders_prods.duplicated()])

Empty DataFrame
Columns: [order_id, product_id, add_to_cart_order, reordered]
Index: []

No full duplicates were found.

In [56]:
# evaluate for mixed-type columns
for col in df_orders_prods.columns.tolist():
  weird = (df_orders_prods[[col]].applymap(type) != df_orders_prods[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_orders_prods[weird]) > 0:
    print (col)

No mixed-type data columns were found.

### `'df_cust'` DATAFRAME

In [57]:
# summary stats
df_cust.describe()

                 age     dependants         income
count  206209.000000  206209.000000  206209.000000
mean       49.501646       1.499823   94632.852548
std        18.480962       1.118433   42473.786988
min        18.000000       0.000000   25903.000000
25%        33.000000       0.000000   59874.000000
50%        49.000000       1.000000   93547.000000
75%        66.000000       3.000000  124244.000000
max        81.000000       3.000000  593901.000000

In [58]:
# evaluate missing values
df_cust.isnull().sum()

user_id           0
gender            0
state             0
age               0
date_joined       0
dependants        0
marital_status    0
income            0
dtype: int64

No missing values were found.

In [59]:
# evaluate for full duplicates
print(df_cust[df_cust.duplicated()])

Empty DataFrame
Columns: [user_id, gender, state, age, date_joined, dependants, marital_status, income]
Index: []

No full duplicates were found.

In [60]:
# evaluate for mixed-type columns
for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

No mixed-type data columns were found.

# COMBINING DATA

In [61]:
# merge 'df_orders' & 'df_orders_prods' dataframes on 'order_id' (matching records only)
df_orders_detailed = df_orders.merge(df_orders_prods, on = 'order_id', indicator = '_merge_orders_prods')

In [62]:
# first 5 rows
df_orders_detailed.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge_orders_prods
0,2539329,1,1,2,8,<NA>,196,1,No,both
1,2539329,1,1,2,8,<NA>,14084,2,No,both
2,2539329,1,1,2,8,<NA>,12427,3,No,both
3,2539329,1,1,2,8,<NA>,26088,4,No,both
4,2539329,1,1,2,8,<NA>,26405,5,No,both

In [63]:
# merge flag frequency counts
df_orders_detailed['_merge_orders_prods'].value_counts()

both          32434489
left_only            0
right_only           0
Name: _merge_orders_prods, dtype: int64

In [64]:
# drop merge flag
df_orders_detailed.drop('_merge_orders_prods', axis = 1, inplace = True)

In [65]:
# merge 'df_orders_detailed' & 'df_prods' dataframes on 'product_id' (matching records only)
df_orders_detailed = df_orders_detailed.merge(df_prods, on = 'product_id', indicator = '_merge_prods_info')

In [66]:
df_orders_detailed.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge_prods_info
0,2539329,1,1,2,8,<NA>,196,1,No,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15,196,1,Yes,Soda,77,7,9.0,both
2,473747,1,3,3,12,21,196,1,Yes,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29,196,1,Yes,Soda,77,7,9.0,both
4,431534,1,5,4,15,28,196,1,Yes,Soda,77,7,9.0,both

In [67]:
# merge flag frequency counts
df_orders_detailed['_merge_prods_info'].value_counts()

both          32433030
left_only            0
right_only           0
Name: _merge_prods_info, dtype: int64

In [68]:
# drop merge flag
df_orders_detailed.drop('_merge_prods_info', axis = 1, inplace = True)

In [69]:
df_orders_detailed.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices
0,2539329,1,1,2,8,<NA>,196,1,No,Soda,77,7,9.0
1,2398795,1,2,3,7,15,196,1,Yes,Soda,77,7,9.0
2,473747,1,3,3,12,21,196,1,Yes,Soda,77,7,9.0
3,2254736,1,4,4,7,29,196,1,Yes,Soda,77,7,9.0
4,431534,1,5,4,15,28,196,1,Yes,Soda,77,7,9.0

In [70]:
# merge 'df_orders_detailed' & 'df_cust' dataframes on 'user_id' (matching records only)
df_orders_detailed = df_orders_detailed.merge(df_cust, on = 'user_id', indicator = '_merge_cust_info')

In [71]:
# merge flag frequency counts
df_orders_detailed['_merge_cust_info'].value_counts()

both          32433030
left_only            0
right_only           0
Name: _merge_cust_info, dtype: int64

In [72]:
# drop merge flag
df_orders_detailed.drop('_merge_cust_info', axis = 1, inplace = True)

In [73]:
df_orders_detailed.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,gender,state,age,date_joined,dependants,marital_status,income
0,2539329,1,1,2,8,<NA>,196,1,No,Soda,77,7,9.0,Female,Alabama,31,2/17/2019,3,married,40423
1,2398795,1,2,3,7,15,196,1,Yes,Soda,77,7,9.0,Female,Alabama,31,2/17/2019,3,married,40423
2,473747,1,3,3,12,21,196,1,Yes,Soda,77,7,9.0,Female,Alabama,31,2/17/2019,3,married,40423
3,2254736,1,4,4,7,29,196,1,Yes,Soda,77,7,9.0,Female,Alabama,31,2/17/2019,3,married,40423
4,431534,1,5,4,15,28,196,1,Yes,Soda,77,7,9.0,Female,Alabama,31,2/17/2019,3,married,40423

In [74]:
df_orders_detailed.dtypes

order_id                   object
user_id                    object
order_number                int64
order_dow                   int64
order_hour_of_day           int64
days_since_prior_order      Int64
product_id                 object
add_to_cart_order           int64
reordered                  object
product_name               object
aisle_id                   object
department_id              object
prices                    float64
gender                     object
state                      object
age                         int64
date_joined                object
dependants                  int64
marital_status             object
income                      int64
dtype: object

In [75]:
df_depts_transposed.dtypes

department_id
department    object
dtype: object

In [76]:
# merge 'df_orders_detailed' & 'df_depts_transposed' dataframes on 'department_id' (matching records only)
df_orders_detailed = df_orders_detailed.merge(df_depts_transposed, right_index = True, left_on = 'department_id', indicator = '_merge_depts_info')

In [77]:
# merge flag frequency flag
df_orders_detailed['_merge_depts_info'].value_counts()

both          32433030
left_only            0
right_only           0
Name: _merge_depts_info, dtype: int64

In [78]:
# drop merge flag
df_orders_detailed.drop('_merge_depts_info', axis = 1, inplace = True)

In [79]:
# first 5 rows
df_orders_detailed.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,department_id,prices,gender,state,age,date_joined,dependants,marital_status,income,department
0,2539329,1,1,2,8,<NA>,196,1,No,Soda,...,7,9.0,Female,Alabama,31,2/17/2019,3,married,40423,beverages
1,2398795,1,2,3,7,15,196,1,Yes,Soda,...,7,9.0,Female,Alabama,31,2/17/2019,3,married,40423,beverages
2,473747,1,3,3,12,21,196,1,Yes,Soda,...,7,9.0,Female,Alabama,31,2/17/2019,3,married,40423,beverages
3,2254736,1,4,4,7,29,196,1,Yes,Soda,...,7,9.0,Female,Alabama,31,2/17/2019,3,married,40423,beverages
4,431534,1,5,4,15,28,196,1,Yes,Soda,...,7,9.0,Female,Alabama,31,2/17/2019,3,married,40423,beverages

In [80]:
# dataframe size
df_orders_detailed.shape

(32433030, 21)

The data from `'df_orders'`, `'df_orders_prods'`, `'df_prods'`, `'df_cust'`, and `'df_depts_transposed'` were combined into one dataframe without losing any records.

# DERIVING VARIABLES

In [81]:
# define product price range flag
df_orders_detailed.loc[(df_orders_detailed['prices'] > 15), 'price_range'] = 'High-range Product'
df_orders_detailed.loc[(df_orders_detailed['prices'] <= 15) & (df_orders_detailed['prices'] > 5), 'price_range'] = 'Mid-range Product'
df_orders_detailed.loc[(df_orders_detailed['prices'] <= 5), 'price_range'] = 'Low-range Product'

In [82]:
# 'price_range' column frequency counts
df_orders_detailed['price_range'].value_counts()

Mid-range Product     21894136
Low-range Product     10126339
High-range Product      412555
Name: price_range, dtype: int64

In [83]:
# define column with maximun number of orders placed per customer
df_orders_detailed['max_order'] = df_orders_detailed.groupby(['user_id'])['order_number'].transform(np.max)

In [84]:
# 'max_order' column frequency counts
df_orders_detailed['max_order'].value_counts()

99    1172192
8      812591
6      812005
9      810789
7      804689
       ...
93      50439
90      48397
97      44969
98      44604
96      40469
Name: max_order, Length: 97, dtype: int64

In [85]:
# define loyalty flag based on 'max_order' column
df_orders_detailed.loc[df_orders_detailed['max_order'] > 40, 'loyalty_flag'] = 'Loyal Customer'
df_orders_detailed.loc[(df_orders_detailed['max_order'] <= 40) & (df_orders_detailed['max_order'] > 10), 'loyalty_flag'] = 'Regular Customer'
df_orders_detailed.loc[df_orders_detailed['max_order'] <= 10, 'loyalty_flag'] = 'New Customer'

In [86]:
# 'loyalty_flag' column frequency counts
df_orders_detailed['loyalty_flag'].value_counts()

Regular Customer    15890458
Loyal Customer      10293434
New Customer         6249138
Name: loyalty_flag, dtype: int64

In [87]:
# define column with the average price of products purchased per customer
df_orders_detailed['mean_spending'] = df_orders_detailed.groupby(['user_id'])['prices'].transform(np.mean)

In [88]:
# define spending flag based on 'mean_spending' column
df_orders_detailed.loc[df_orders_detailed['mean_spending'] < 10, 'spending_flag'] = 'Low Spender'
df_orders_detailed.loc[df_orders_detailed['mean_spending'] >= 10, 'spending_flag'] = 'High Spender'

In [89]:
# 'spending_flag' column frequency counts
df_orders_detailed['spending_flag'].value_counts()

Low Spender     32312331
High Spender      120699
Name: spending_flag, dtype: int64

In [90]:
# define column with median days passed since previous order per customer
df_orders_detailed['median_frequency'] = df_orders_detailed.groupby(['user_id'])['days_since_prior_order'].transform(np.median)

In [91]:
# define customer frequency flag based on 'median_frequency' column
df_orders_detailed.loc[df_orders_detailed['median_frequency'] > 20, 'frequency_flag'] = 'Non-frequent Customer'
df_orders_detailed.loc[(df_orders_detailed['median_frequency'] <= 20) & (df_orders_detailed['median_frequency'] > 10), 'frequency_flag'] = 'Regular Customer'
df_orders_detailed.loc[df_orders_detailed['median_frequency'] <= 10, 'frequency_flag'] = 'Frequent Customer'

In [92]:
# 'frequency_flag' column frequency counts
df_orders_detailed['frequency_flag'].value_counts()

Frequent Customer        21576963
Regular Customer          7216644
Non-frequent Customer     3639423
Name: frequency_flag, dtype: int64

In [93]:
# define income class flag based on the 20th, 40th, 60th, and 80th percentiles from the 'income' column
percentiles = df_orders_detailed['income'].quantile([0.2, 0.4, 0.6, 0.8])

df_orders_detailed.loc[df_orders_detailed['income'] <= percentiles[0.2], 'income_class'] = 'Lower Class'
df_orders_detailed.loc[(df_orders_detailed['income'] > percentiles[0.2]) & (df_orders_detailed['income'] <= percentiles[0.4]), 'income_class'] = 'Lower-middle Class'
df_orders_detailed.loc[(df_orders_detailed['income'] > percentiles[0.4]) & (df_orders_detailed['income'] <= percentiles[0.6]), 'income_class'] = 'Middle Class'
df_orders_detailed.loc[(df_orders_detailed['income'] > percentiles[0.6]) & (df_orders_detailed['income'] <= percentiles[0.8]), 'income_class'] = 'Upper-middle Class'
df_orders_detailed.loc[df_orders_detailed['income'] > percentiles[0.8], 'income_class'] = 'Upper Class'

In [94]:
# 'income_class' column frequency counts
df_orders_detailed['income_class'].value_counts()

Lower-middle Class    6487737
Lower Class           6486734
Upper Class           6486606
Upper-middle Class    6486020
Middle Class          6485933
Name: income_class, dtype: int64

In [95]:
# unique values in 'state'
df_orders_detailed['state'].unique()

array(['Alabama', 'Indiana', 'Louisiana', 'Montana', 'Oklahoma',
       'Tennessee', 'Iowa', 'Ohio', 'Virginia', 'Connecticut', 'Kentucky',
       'Oregon', 'South Dakota', 'Michigan', 'New Jersey', 'Arizona',
       'Maine', 'Hawaii', 'Minnesota', 'Illinois', 'Idaho', 'Kansas',
       'North Carolina', 'Vermont', 'Alaska', 'Delaware', 'Maryland',
       'Nebraska', 'Nevada', 'Arkansas', 'Georgia',
       'District of Columbia', 'Utah', 'Colorado', 'Florida',
       'South Carolina', 'Rhode Island', 'Washington', 'California',
       'Mississippi', 'Texas', 'New Mexico', 'Missouri', 'Wyoming',
       'New Hampshire', 'Massachusetts', 'Pennsylvania', 'Wisconsin',
       'West Virginia', 'North Dakota', 'New York'], dtype=object)

In [96]:
# categorize states into the 4 major regions of the United States
reg_result = []

for i in df_orders_detailed['state']:
    if i in ['Connecticut', 'Maine', 'Massachusetts', 'New Hampshire', 'Rhode Island', 'Vermont', 'New Jersey', 'New York', 'Pennsylvania']:
        reg_result.append('Northeast')
    elif i in ['Indiana', 'Illinois', 'Michigan', 'Ohio', 'Wisconsin', 'Iowa', 'Kansas', 'Minnesota', 'Missouri', 'Nebraska', 'North Dakota', 'South Dakota']:
        reg_result.append('Midwest')
    elif i in ['Delaware', 'District of Columbia', 'Florida', 'Georgia', 'Maryland', 'North Carolina', 'South Carolina', 'Virginia', 'West Virginia', 'Alabama', 'Kentucky', 'Mississippi', 'Tennessee', 'Arkansas', 'Louisiana', 'Oklahoma', 'Texas']:
        reg_result.append('South')
    else:
        reg_result.append('West')

In [97]:
# define region column & fill with 'reg_result' list
df_orders_detailed['region'] = reg_result

In [98]:
# define shopping activity flag based on the total number of orders placed per customer
df_orders_detailed.loc[df_orders_detailed['max_order'] <= 5, 'activity_flag'] = 'Low Activity'
df_orders_detailed.loc[df_orders_detailed['max_order'] > 5, 'activity_flag'] = 'Recurrent Activity'

In [99]:
# 'activity_flag' column frequency counts
df_orders_detailed['activity_flag'].value_counts()

Recurrent Activity    30197745
Low Activity           2235285
Name: activity_flag, dtype: int64

In [100]:
df_cust.describe()

                 age     dependants         income
count  206209.000000  206209.000000  206209.000000
mean       49.501646       1.499823   94632.852548
std        18.480962       1.118433   42473.786988
min        18.000000       0.000000   25903.000000
25%        33.000000       0.000000   59874.000000
50%        49.000000       1.000000   93547.000000
75%        66.000000       3.000000  124244.000000
max        81.000000       3.000000  593901.000000

In [101]:
# define age flag based on customer ages
df_orders_detailed.loc[(df_orders_detailed['age'] >= 18) & (df_orders_detailed['age'] < 45), 'age_flag'] = 'Early Adulthood'
df_orders_detailed.loc[(df_orders_detailed['age'] >= 45) & (df_orders_detailed['age'] < 65), 'age_flag'] = 'Middle Adulthood'
df_orders_detailed.loc[df_orders_detailed['age'] >= 65, 'age_flag'] = 'Late Adulthood'

In [102]:
# 'age_flag' column frequency counts
df_orders_detailed['age_flag'].value_counts()

Early Adulthood     13701771
Middle Adulthood    10148899
Late Adulthood       8582360
Name: age_flag, dtype: int64

In [103]:
# define parental boolean flag based on whether a customer has dependants or not
df_orders_detailed.loc[df_orders_detailed['dependants'] == 0, 'is_parent'] = 'No'
df_orders_detailed.loc[df_orders_detailed['dependants'] >= 1, 'is_parent'] = 'Yes'

In [104]:
# 'is_parent' column frequency counts
df_orders_detailed['is_parent'].value_counts()

Yes    24328189
No      8104841
Name: is_parent, dtype: int64

In [105]:
# define period flag based on order hours
df_orders_detailed.loc[df_orders_detailed['order_hour_of_day'] < 12, 'hour_period'] = 'AM'
df_orders_detailed.loc[df_orders_detailed['order_hour_of_day'] >= 12, 'hour_period'] = 'PM'

In [106]:
# 'age_flag' column frequency counts
df_orders_detailed['hour_period'].value_counts()

PM    20974332
AM    11458698
Name: hour_period, dtype: int64

# EXPORTING DATA

In [107]:
# export dataframe as pickle
df_orders_detailed.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_final.pkl'))